fio/results/fio-res_201904191726
Seq-Read-1m: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq-Write-1m: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4k-32qd: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4k-32qd: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.1
Starting 4 processes
Seq-Read-1m: Laying out IO file (1 file / 4096MiB)
3;fio-3.1;Seq-Read-1m;0;0;688128;68730;67;10012;53;472;85.149637;21.033373;2277;21892;14806.967412;4214.095517;1.000000%=2605;5.000000%=2899;10.000000%=3555;20.000000%=16056;30.000000%=16187;40.000000%=16318;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16318;90.000000%=16449;95.000000%=16908;99.000000%=17432;99.500000%=17694;99.900000%=21889;99.950000%=21889;99.990000%=21889;0%=0;0%=0;0%=0;2486;21995;14893.001509;4220.503935;48301;159647;80.083393%;55041.315789;25343.981339;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.000000%;0.739113%;673;0;287;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;11.16%;0.00%;88.69%;0.15%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39082;36559;0;0;365607;364358;730045;98.26%
3;fio-3.1;Seq-Write-1m;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;688128;68730;67;10012;54;179;115.782994;22.731481;2970;141028;14776.134607;6521.979089;1.000000%=3162;5.000000%=3391;10.000000%=3555;20.000000%=16056;30.000000%=16187;40.000000%=16187;50.000000%=16187;60.000000%=16318;70.000000%=16318;80.000000%=16318;90.000000%=16449;95.000000%=16449;99.000000%=18743;99.500000%=20054;99.900000%=141557;99.950000%=141557;99.990000%=141557;0%=0;0%=0;0%=0;3046;141136;14892.826388;6530.648362;45988;155058;76.511904%;52586.631579;24826.366343;0.169813%;0.779143%;674;0;26;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;12.65%;0.30%;86.61%;0.30%;0.00%;0.15%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39082;36559;0;0;365607;364358;730045;98.26%
3;fio-3.1;Rand-Read-4k-32qd;2;0;134748;13459;3364;10011;2;66;8.315888;1.951907;324;20241;9496.821578;2889.211990;1.000000%=700;5.000000%=864;10.000000%=5406;20.000000%=10289;30.000000%=10289;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10682;95.000000%=10682;99.000000%=11337;99.500000%=11993;99.900000%=15138;99.950000%=15794;99.990000%=19529;0%=0;0%=0;0%=0;333;20249;9505.742322;2889.848290;8714;29731;73.113276%;9840.315789;4816.756978;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.949051%;6.163836%;31897;0;61;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.03%;1.79%;6.40%;1.67%;0.08%;1.13%;88.90%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39082;36559;0;0;365607;364358;730045;98.26%
3;fio-3.1;Rand-Write-4k-32qd;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;125044;12490;3122;10011;3;47;9.882405;2.351316;588;26606;10233.135207;1482.630478;1.000000%=1744;5.000000%=10289;10.000000%=10289;20.000000%=10420;30.000000%=10420;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10551;95.000000%=10551;99.000000%=11862;99.500000%=13565;99.900000%=17694;99.950000%=19791;99.990000%=25559;0%=0;0%=0;0%=0;610;26615;10243.637658;1483.034233;12223;17280;100.000000%;12490.750000;1127.330749;0.769231%;6.163836%;30613;0;27;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;0.03%;2.12%;0.42%;1.32%;96.04%;0.04%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39082;36559;0;0;365607;364358;730045;98.26%

Seq-Read-1m: (groupid=0, jobs=1): err= 0: pid=4168: Fri Apr 19 17:27:57 2019
   read: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10012msec)
    slat (usec): min=53, max=472, avg=85.15, stdev=21.03
    clat (usec): min=2277, max=21892, avg=14806.97, stdev=4214.10
     lat (usec): min=2486, max=21995, avg=14893.00, stdev=4220.50
    clat percentiles (usec):
     |  1.00th=[ 2606],  5.00th=[ 2900], 10.00th=[ 3556], 20.00th=[16057],
     | 30.00th=[16188], 40.00th=[16319], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16319], 90.00th=[16450], 95.00th=[16909],
     | 99.00th=[17433], 99.50th=[17695], 99.90th=[21890], 99.95th=[21890],
     | 99.99th=[21890]
   bw (  KiB/s): min=48301, max=159647, per=80.08%, avg=55041.32, stdev=25343.98, samples=19
   iops        : min=   47, max=  155, avg=53.21, stdev=24.65, samples=19
  lat (msec)   : 4=11.16%, 20=88.69%, 50=0.15%
  cpu          : usr=0.00%, sys=0.74%, ctx=673, majf=0, minf=287
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=672,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq-Write-1m: (groupid=1, jobs=1): err= 0: pid=4169: Fri Apr 19 17:27:57 2019
  write: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10012msec)
    slat (usec): min=54, max=179, avg=115.78, stdev=22.73
    clat (msec): min=2, max=141, avg=14.78, stdev= 6.52
     lat (msec): min=3, max=141, avg=14.89, stdev= 6.53
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[   17],
     | 30.00th=[   17], 40.00th=[   17], 50.00th=[   17], 60.00th=[   17],
     | 70.00th=[   17], 80.00th=[   17], 90.00th=[   17], 95.00th=[   17],
     | 99.00th=[   19], 99.50th=[   21], 99.90th=[  142], 99.95th=[  142],
     | 99.99th=[  142]
   bw (  KiB/s): min=45988, max=155058, per=76.51%, avg=52586.63, stdev=24826.37, samples=19
   iops        : min=   44, max=  151, avg=50.68, stdev=24.31, samples=19
  lat (msec)   : 4=12.65%, 10=0.30%, 20=86.61%, 50=0.30%, 250=0.15%
  cpu          : usr=0.17%, sys=0.78%, ctx=674, majf=0, minf=26
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,672,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4k-32qd: (groupid=2, jobs=1): err= 0: pid=4171: Fri Apr 19 17:27:57 2019
   read: IOPS=3364, BW=13.1MiB/s (13.8MB/s)(132MiB/10011msec)
    slat (nsec): min=2735, max=66275, avg=8315.89, stdev=1951.91
    clat (usec): min=324, max=20241, avg=9496.82, stdev=2889.21
     lat (usec): min=333, max=20249, avg=9505.74, stdev=2889.85
    clat percentiles (usec):
     |  1.00th=[  701],  5.00th=[  865], 10.00th=[ 5407], 20.00th=[10290],
     | 30.00th=[10290], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10683], 95.00th=[10683],
     | 99.00th=[11338], 99.50th=[11994], 99.90th=[15139], 99.95th=[15795],
     | 99.99th=[19530]
   bw (  KiB/s): min= 8714, max=29731, per=73.11%, avg=9840.32, stdev=4816.76, samples=19
   iops        : min= 2178, max= 7432, avg=2459.79, stdev=1204.08, samples=19
  lat (usec)   : 500=0.03%, 750=1.79%, 1000=6.40%
  lat (msec)   : 2=1.67%, 4=0.08%, 10=1.13%, 20=88.90%, 50=0.01%
  cpu          : usr=0.95%, sys=6.16%, ctx=31897, majf=0, minf=61
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=33687,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4k-32qd: (groupid=3, jobs=1): err= 0: pid=4173: Fri Apr 19 17:27:57 2019
  write: IOPS=3122, BW=12.2MiB/s (12.8MB/s)(122MiB/10011msec)
    slat (nsec): min=3002, max=47213, avg=9882.40, stdev=2351.32
    clat (usec): min=588, max=26606, avg=10233.14, stdev=1482.63
     lat (usec): min=610, max=26615, avg=10243.64, stdev=1483.03
    clat percentiles (usec):
     |  1.00th=[ 1745],  5.00th=[10290], 10.00th=[10290], 20.00th=[10421],
     | 30.00th=[10421], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10552], 95.00th=[10552],
     | 99.00th=[11863], 99.50th=[13566], 99.90th=[17695], 99.95th=[19792],
     | 99.99th=[25560]
   bw (  KiB/s): min=12223, max=17280, per=100.00%, avg=12490.75, stdev=1127.33, samples=20
   iops        : min= 3055, max= 4320, avg=3122.65, stdev=281.84, samples=20
  lat (usec)   : 750=0.02%, 1000=0.03%
  lat (msec)   : 2=2.12%, 4=0.42%, 10=1.32%, 20=96.04%, 50=0.04%
  cpu          : usr=0.77%, sys=6.16%, ctx=30613, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,31261,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10012-10012msec

Run status group 1 (all jobs):
  WRITE: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10012-10012msec

Run status group 2 (all jobs):
   READ: bw=13.1MiB/s (13.8MB/s), 13.1MiB/s-13.1MiB/s (13.8MB/s-13.8MB/s), io=132MiB (138MB), run=10011-10011msec

Run status group 3 (all jobs):
  WRITE: bw=12.2MiB/s (12.8MB/s), 12.2MiB/s-12.2MiB/s (12.8MB/s-12.8MB/s), io=122MiB (128MB), run=10011-10011msec

Disk stats (read/write):
  xvda: ios=39082/36559, merge=0/0, ticks=365607/364358, in_queue=730045, util=98.26%